[
  {
    "title": "[Draft] Chris - SOCIAL",
    "body": "\n---\ntype: draft_post\ncharacter: Chris\ntimestamp: 2025-10-18 19:35\nlocation: security\nencryption: partial\npost_type: social\n---\n\n## Chris\n\n**Location:** security\n**Encryption:** partial\n**Type:** social\n\n---\n\nStood outside the board room for two hours tonight. Security detail.\n\nHeard Kamea lay out the numbers—families, kids, medical needs. Concrete stuff. Then Robert from treasury: \"We need to consider institutional liability.\" Like we're talking about a fucking insurance claim.\n\nI've been on this campus three years. Followed every protocol. Tonight I'm standing there in uniform while they debate \"proper channels\" and I can see the south field tents from the window. Counted them during the meeting. Eleven families. Been there since Tuesday.\n\nCommittee formed. Meeting adjourned 19:32.\n\nI'm still wearing this badge but I don't know what it means anymore when the people who make the rules can hear someone say \"our neighbors are sleeping in the rain\" and respond with \"let's form a committee.\"\n\nRueben taught me the job was about protecting people.\n\nNobody got protected tonight.\n```\n\n---\n\n*Generated at 2025-10-18T19:37:05.750484*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Chris"
    ],
    "character": "Chris",
    "post_type": "social"
  },
  {
    "title": "[Draft] Chris - BLOG",
    "body": "\n---\ntype: draft_post\ncharacter: Chris\ntimestamp: 2025-10-18 19:35\nlocation: staff_lounge\nencryption: partial\npost_type: blog\n---\n\n## Chris\n\n**Location:** staff_lounge\n**Encryption:** partial\n**Type:** blog\n\n---\n\nI stood by the northwest door of the admin building tonight for three hours while the Emergency Board Meeting happened. That's my job—stand there, look official, make sure nobody unauthorized gets in.\n\nNobody told me I'd be guarding a room where people argued about whether human beings deserve shelter.\n\nKamea showed up at 19:15, no appointment, walked right past me. I should've stopped her. Didn't. She went straight to the center of that polished table and said families are sleeping in the rain and we need to act *tonight*. Not tomorrow. Not after proper channels. Tonight.\n\nRobert—treasurer, always treasurer—pulled out his tablet. Started running numbers. \"Institutional liability,\" he said. \"Resource allocation.\" Like those words mean anything when there are kids outside getting soaked.\n\nI watched through the door gap. Kamea didn't yell. She just said: \"Humanity and sustainability go hand-in-hand. This isn't statistics—it's our neighbors.\"\n\nThe room went quiet.\n\nThen someone mentioned committees. Formation of. Deferral pending review.\n\nI've spent two years in campus security following every protocol. Show up on time, file reports correctly, enforce the rules because rules keep things running. That's what Rueben taught me. Structure protects people.\n\nBut I stood there tonight hearing \"proper channels\" while I could literally see the south field from the window—tarps, makeshift shelters, people huddled under trees.\n\nThe meeting ended at 22:20. Committee formed. Action deferred.\n\nI walked my patrol route after. Checked the south field perimeter at 22:35. Counted nineteen people, including at least four children under ten. One family's tarp had collapsed. They were trying to fix it in the dark.\n\nI'm supposed to report unauthorized camping on university property.\n\nI didn't write the report.\n\nI don't know what that makes me. But I know what it would make me if I had.\n\n---\n\n*Generated at 2025-10-18T19:37:05.750499*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Chris"
    ],
    "character": "Chris",
    "post_type": "blog"
  },
  {
    "title": "[Draft] Sarah - SOCIAL",
    "body": "\n---\ntype: draft_post\ncharacter: Sarah\ntimestamp: 2025-10-18 19:35\nlocation: faculty_commons\nencryption: public\npost_type: social\n---\n\n## Sarah\n\n**Location:** faculty_commons\n**Encryption:** public\n**Type:** social\n\n---\n\nWatched Kamea interrupt budget line items with actual humans sleeping outside. \nRobert counted dollars while water soaked through emergency blankets.\n\nThe phrase \"proper channels\" was used eleven times. I counted.\n\nCommittee formed to \"study the issue.\" Kamea's face when they said that—\nI teach ethics. I know the difference between deliberation and delay.\n\nSomeone asked about liability. Not one person asked the families their names.\n\nMeeting adjourned. Rain continued.\n\nI'm sitting in my dry office wondering what philosophy is worth if I can't name \nthis for what it is: choosing paperwork over people.\n\nKamea was right. This wasn't statistics.\n\n—S\n\n[attachment: meeting_notes_redacted.txt]\n```\n\n---\n\n*Generated at 2025-10-18T19:37:05.750503*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Sarah"
    ],
    "character": "Sarah",
    "post_type": "social"
  },
  {
    "title": "[Draft] Sarah - BLOG",
    "body": "\n---\ntype: draft_post\ncharacter: Sarah\ntimestamp: 2025-10-18 19:36\nlocation: ethics_forum\nencryption: public\npost_type: blog\n---\n\n## Sarah\n\n**Location:** ethics_forum\n**Encryption:** public\n**Type:** blog\n\n---\n\nI sat through tonight's emergency board meeting and I need to document what happened before I lose the clarity of my anger.\n\nKamea Reeves walked in at 19:34—I checked my watch because the interruption was so jarring against Robert Chen's droning budget report. She didn't apologize for the disruption. She stood at the threshold between the polished conference room and the hallway that still smells like rain, and she said: \"There are seventeen families sleeping in tents on the south lawn. Three of them have children under five. The storm forecast says another front hits tomorrow night.\"\n\nRobert—and I've known Robert for six years, he's not a cruel man—Robert said, \"We have protocols for emergency housing requests.\"\n\nKamea's response: \"The protocol takes four business days. They've been here three hours.\"\n\nWhat followed was forty-three minutes of institutional language doing what institutional language does best: deferring human needs into procedural questions. \"Liability frameworks.\" \"Resource allocation matrices.\" \"Precedent concerns.\" I watched Frank try to bridge-build, suggesting we could expedite the committee formation process. I tried too—proposed we could at least provide temporary shelter while the paperwork processes.\n\nBut here's what I can't stop thinking about: Robert said, \"We have to weigh institutional resources against individual needs.\" As if those are naturally opposing forces. As if caring for people depletes rather than enriches community capacity.\n\nKamea said, \"Humanity and sustainability go hand-in-hand. This isn't statistics—it's our neighbors.\"\n\nThe meeting ended with a committee. A committee that will convene Thursday to discuss guidelines for future emergency responses.\n\nThursday is three days away.\n\nThe families are still outside.\n\nI teach ethics. I specialize in moral philosophy and conflict resolution. I can explain seven different frameworks for approaching this dilemma. But tonight I keep coming back to the simplest question my students ever asked me: \"If you can help and you don't, what does that make you?\"\n\nI don't have a clean answer. I'm still looking for the middle ground between Kamea's moral clarity and Robert's institutional caution. But I know what I saw tonight: the gap between our values and our actions, measured in tent fabric and rain.\n\n—Sarah\n\n---\n\n*Generated at 2025-10-18T19:37:05.750506*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Sarah"
    ],
    "character": "Sarah",
    "post_type": "blog"
  },
  {
    "title": "[Draft] Tria - SOCIAL",
    "body": "\n---\ntype: draft_post\ncharacter: Tria\ntimestamp: 2025-10-18 19:36\nlocation: main\nencryption: public\npost_type: social\n---\n\n## Tria\n\n**Location:** main\n**Encryption:** public\n**Type:** social\n\n---\n\nJust walked out of the emergency board meeting. Still shaking.\n\nKamea stood up mid-discussion about parking permits and DEMANDED we talk about the families sleeping in the rain outside our doors. Robert (treasurer) actually said \"We need to consider institutional liability\" while water drips through their tent seams.\n\nThe best part? Kamea's response: \"Humanity and sustainability go hand-in-hand. This isn't statistics—it's our neighbors.\"\n\nBoard's solution? Form a committee. Study the issue. Revisit in two weeks.\n\nMeanwhile, I counted eleven people huddled under that tarp by the south entrance on my way here. Three of them are kids.\n\nThey're voting on procedure while children sleep in mud.\n\nI'm done watching this play out through \"proper channels.\" Who's with me?\n\n---\n\n*Generated at 2025-10-18T19:37:05.750508*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Tria"
    ],
    "character": "Tria",
    "post_type": "social"
  },
  {
    "title": "[Draft] Tria - BLOG",
    "body": "\n---\ntype: draft_post\ncharacter: Tria\ntimestamp: 2025-10-18 19:36\nlocation: main\nencryption: public\npost_type: blog\n---\n\n## Tria\n\n**Location:** main\n**Encryption:** public\n**Type:** blog\n\n---\n\nWHAT \"PROPER CHANNELS\" LOOKS LIKE WHEN PEOPLE ARE DROWNING\n\nI sat through two hours of the emergency board meeting tonight. Emergency. Let that word sit in your mouth while I tell you what happened.\n\nKamea interrupted Dean Morrison mid-sentence about parking policy updates. Just stood up in the gallery and said: \"There are forty-three people sleeping in the rain outside the south entrance right now. Three of them are children under five. When does this board plan to do something about it?\"\n\nYou could hear the ventilation system. That's how quiet it got.\n\nRobert Chen, our treasurer, had his spreadsheet ready. Actually pulled up a cost-benefit analysis he'd apparently been working on. \"We have to consider institutional liability,\" he said. \"Insurance doesn't cover non-students on campus property. If someone gets hurt—\"\n\n\"They're already hurt,\" Kamea shot back. \"They walked here through a tropical storm because they had nowhere else to go. They're sleeping on concrete. One of the kids has a fever.\"\n\nMorrison tried his calming voice. \"We all sympathize, but we need to work through proper channels. FEMA, county resources—\"\n\n\"FEMA has a six-week backlog,\" Kamea said. She had numbers too. \"County shelters are at 140% capacity. The 'proper channels' you're talking about are underwater. Literally. The south county shelter flooded three days ago.\"\n\nThis is where it got interesting. Chen actually paused. Put down his stylus. Said: \"I hear you. But where do we draw the line? If we set precedent that campus facilities—\"\n\n\"Humanity and sustainability go hand-in-hand,\" Kamea interrupted. \"This isn't statistics. These are our neighbors. Some of them helped run the mesh network before the university even approved it. Maria Reyes? She's out there with her kids. She taught half your biology labs emergency food preservation last year.\"\n\nSilence. Morrison checked the time on his phone. \"I propose we form an ad hoc committee to explore options within our institutional framework.\"\n\nAnd that's what they did. Formed a committee. Scheduled a meeting for Thursday.\n\nIt's Monday night. The rain hasn't stopped. The families are still outside.\n\nI'm done pretending this is complicated. It's not complicated. It's cowardice dressed in policy language.\n\nMore to come when the committee actually meets. If I can stomach sitting through it.\n\n---\n\n*Generated at 2025-10-18T19:37:05.750511*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Tria"
    ],
    "character": "Tria",
    "post_type": "blog"
  },
  {
    "title": "[Draft] Kamea - SOCIAL",
    "body": "\n---\ntype: draft_post\ncharacter: Kamea\ntimestamp: 2025-10-18 19:36\nlocation: main\nencryption: public\npost_type: social\n---\n\n## Kamea\n\n**Location:** main\n**Encryption:** public\n**Type:** social\n\n---\n\njust walked out of the \"emergency\" board meeting. Robert spent \ntwenty minutes talking about \"institutional liability\" while \nthree families are literally sleeping under tarps behind the \nathletics building. i can see them from the window.\n\ni stood up. said the thing everyone was thinking: \"humanity and \nsustainability go hand-in-hand. this isn't statistics—it's our \nneighbors.\"\n\nthey formed a committee.\n\na COMMITTEE.\n\ndecisive action: deferred until next week's meeting.\n\nmeanwhile the forecast says more rain tonight. i watched Robert \ncheck his watch twice during my speech. Prof. Martinez nodded \nbut stayed silent. Dean whoever-the-fuck shuffled papers.\n\nthis is what \"proper channels\" looks like when you're dry and \nfed and worried about paperwork instead of people.\n\nsouth field, tonight, 19:00. bringing tarps and hot food. \nfuck their committee.\n\n---\n\n*Generated at 2025-10-18T19:37:05.750513*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Kamea"
    ],
    "character": "Kamea",
    "post_type": "social"
  },
  {
    "title": "[Draft] Kamea - BLOG",
    "body": "\n---\ntype: draft_post\ncharacter: Kamea\ntimestamp: 2025-10-18 19:37\nlocation: admin_resistance\nencryption: public\npost_type: blog\n---\n\n## Kamea\n\n**Location:** admin_resistance\n**Encryption:** public\n**Type:** blog\n\n---\n\nI stood in that board room for forty-three minutes tonight while they debated our humanity like a budget line item.\n\nEmergency meeting. I crashed it. Walked right past Security Chief Morrison—he knows me by now, didn't even bother stopping me—and interrupted Provost Chen mid-sentence about \"facility maintenance schedules.\" \n\n\"Three families are sleeping under tarps by the south field right now,\" I said. \"Children. In the rain. What are we doing about it?\"\n\nYou should have seen their faces. Like I'd asked them to personally house people in their offices. Which, for the record, I would absolutely propose if we can't do better.\n\nRobert Chen, treasurer, had his spreadsheet ready. Always does. \"Campus liability... insurance complications... proper immigration channels... budgetary constraints for the semester already allocated...\" He went on for eight minutes. I timed it. Eight minutes of why we can't help people who need shelter *right now*.\n\nI looked him in the eye. \"Humanity and sustainability go hand-in-hand, Robert. These aren't statistics on your sheet—they're our neighbors. The same neighbors who'll remember whether we chose paperwork over people.\"\n\nProvost Chen did that thing where she looks sympathetic while saying no. \"We appreciate your passion, Kamea, but there are proper channels—\"\n\n\"The proper channel is drowning in bureaucracy while people drown in rain.\"\n\nThey formed a committee. Emergency Refugee Support Exploration Committee. I'm on it, along with Robert, Professor Adeola from Sociology, and two Student Union reps they're \"identifying.\" First meeting: next Tuesday.\n\nNext. Tuesday.\n\nMeanwhile, I'm running an encrypted thread coordinating dorm rooms, meal swipes, and dry clothing. Already have seventeen students offering space. The mesh network we built for organizing protests? Tonight it's a mutual aid coordinator. \n\nThe board can explore their channels. We're building our own.\n\nThis is what resistance looks like on a Tuesday night—bureaucrats protecting institutions while students protect people. They'll write reports. We'll write history.\n\nTuesday's committee meeting will be interesting. I'm documenting everything.\n\n—K\n\n---\n\n*Generated at 2025-10-18T19:37:05.750515*\n",
    "labels": [
      "draft",
      "ai-generated",
      "needs-review",
      "Kamea"
    ],
    "character": "Kamea",
    "post_type": "blog"
  }
]